# 1.Напишіть функцію, що приймає один аргумент будь-якого типу та повертає цей аргумент, перетворений на float.
# Якщо перетворити не вдається функція має повернути 0.
def to_float(value):
   try:
    return float(value)
   except (TypeError, ValueError):
    return 0
#2.Напишіть функцію, що приймає два аргументи. Функція повинна
#якщо аргументи відносяться до числових типів (int, float) - повернути перемножене значення цих аргументів,
#якщо обидва аргументи це строки (str) - обʼєднати в одну строку та повернути
#у будь-якому іншому випадку повернути кортеж з цих аргументів

def process_arguments(arg1, arg2):
    if isinstance(arg1, (int, float)) and isinstance(arg2, (int, float)):
        return arg1 * arg2
    elif isinstance(arg1, str) and isinstance(arg2, str):
        return arg1 + arg2
    else:
        return arg1, arg2

# 3.Перепишіть за допомогою функцій вашу программу "Касир в кінотеатрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік.
# - якщо користувачу менше 7 - вивести "Тобі ж <> <>! Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Тобі лише <> <>, а це е фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Вам <> <>? Покажіть пенсійне посвідчення!"
# - якщо вік користувача містить 7 - вивести "Вам <> <>, вам пощастить"
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <> <>, білетів всеодно нема!"
# Замість <> <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік.
# Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача
# (1 - рік, 22 - роки, 35 - років і тд...)
def check_age(age):
    if age < 7:
        return f"Тобі ж {age} рік! Де твої батьки?"
    elif age < 16:
        return f"Тобі лише {age} роки, а це е фільм для дорослих!"
    elif age > 65:
        return f"Вам {age} років? Покажіть пенсійне посвідчення!"
    elif "7" in str(age):
        return f"Вам {age} років, вам пощастить!"
    else:
        return f"Незважаючи на те, що вам {age} років, білетів всеодно нема!"

user_age = int(input("Введіть ваш вік: "))
result = check_age(user_age)
print(result)