#Задача: Створіть дві змінні first=10, second=30. Виведіть на екран результат математичної взаємодії (+, -, *, / и тд.) для цих чисел.
a = 10
b = 30
c = a + b
print(c)
a = 10
b = 30
c = a - b
print(c)
a = 10
b = 30
c = a * b
print(c)
a = 10
b = 30
c = a / b
print(c)
#Задача: Створіть змінну і почергово запишіть в неї результат порівняння (<, > , ==, !=) чисел з завдання 1. Виведіть на екран результат кожного порівняння.
my_bool = 10 < 30
print(my_bool)
my_bool = 10 > 30
print(my_bool)
my_bool = 10 == 30
print(my_bool)
my_bool = 10 != 30
print(my_bool)
#Задача: Створіть змінну - результат конкатенації (складання) строк str1="Hello " и str2="world". Виведіть на екран.
lang = "world"
print("hello"+lang)









