#Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:


#Попросіть користувача ввести свсвій вік (можно використати константу або input()).

#- якщо користувачу менше 6 - вивести повідомлення "Де твої батьки?"

#- якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"

#- якщо користувачу більше 65 - вивести повідомлення "Покажіть пенсійне посвідчення!"

#- якщо вік користувача містить цифру 7 - вивести повідомлення "Вам пощастить!"

#- у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"

#P.S. На екран має бути виведено лише одне повідомлення, якщо вік користувача містить цифру 7 - тільки відповідне повідомлення!
# Також подумайте над варіантами, коли введені невірні або неадекватні (неможливі) дані.

number = input("Вкажіть свій вік: ")
if number.isdigit():
    int_number = int(number)
    print(number)
else:
    print("Вибачте білетів вже немає")
if  "7" in str(number):
    print("Тобі пощастить")
elif int(number) <= 6:
  print("Де твої батьки ?")
elif int(number) <= 18 :
  print("Це фільм для дорослих")
elif int(number) >= 65 :
  print("Де твоє пенсійне посвідчення ")
elif int(number) >= 18 :
  print(" Приємного перегляду ")
  # Де що змінив умови задачі , тим самим закрив прогалину в віці вівідувачів , підняв вікову группу до 18 та зробив
  #повідомлення для відвідувачів в категорії 18-65!
  # Відповіді на додаткові питання
  # 1. Що ви бачите як результат цього курсу ?: Бачу модливість опанування мови phyton!
  # 2. Як ви збираєтесь використовувати цей результат ? : Як додаткове джерело доходу !
  # 3. Чим ви готові пожертвувати заради результату ? : Жертва поганий вислів ! У мене є ідея , інструмент , ціль ,
  # Тому вважаю все вийде без жертв !




